# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент,
# разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.


a = int(input("Введите первый элемент прогрессии:"))
d = int(input("Введите разность прогрессии:"))
n = int(input("Введите количество элементов прогрессии:"))
# c = a + (n-1) * d
# print(c)  # работает, выдает нужный член прогрессии

new_list = list()
def arrif(a, d, n, i=1):
    if n == 1:
        return a
    if i == n:
        return new_list
    else:
        for i in range (1,n):
            new_list.append(a + (i - 1) * d)
        return arrif(a, d, n, i+1)

new_list = arrif(a,d,n+1)
print(f"Арифметическая прогрессия: {new_list}")
