# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику.
# Она растёт на круглой грядке, причём кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное
# число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из
# управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь
# непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход
# собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

# считаем сумму первых 3х эл-тов списка и обновляем мах, если новая сумма больше предыдущей. возвращаем большую сумму
def sum_of_3(list_1, total, max_sum, new_list):
    for i in range(3):
        total += list_1[i]
    new_list.append(total)
    return (new_list)


def move_one_digit(list_1):  # передвигаем одну цифру с конца в начало списка
    for i in range(1):
        x = list_1.pop()
        list_1.insert(0, x)
    return (list_1)


num = int(input("Number of plants:"))
list_1 = list()
for i in range(num):
    list_1.append(int(input("Amount of berries on the bush:")))
print(f"Berries on the bushes:{list_1}")

new_list = list()
max_sum = 0
total = 0
for i in range(num):
    sum_of_3(list_1, total, max_sum, new_list)
    move_one_digit(list_1)
print(f"max num of berries can be picked up at once:{max(new_list)}")
